///////////////////////////////////////////SYSCONST_v0001_06.07.2011////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/* Файл        :  sysconst.h
** Описание    :  Системные константы
** Автор       :  Пшеничный И. Т:275-32-00, 32-57, 33-35
*/

#ifndef _SYSCONST
#define _SYSCONST





/* Радиус сферы Земли ,км */
#define  RZ      6371.0

/* Угловая скорость вращения Земли, рад/сек */
#define  OMEGAZ     0.0000729211585530659

//мю
#define  MU		    398600.44

/* Число Пи */
#define  PI         3.141592653589793//2//3846264338327950288

/* Производные от Пи величины */
/* (2.0*PI)                              */
#define  DVAPI      6.283185307179586//5//(47)//692528676655800576
/* (PI/2.0)                              */
#define  PINADVA    1.5707963267948966//1923132169163975144
/* (PI/180.0)     Радиан в одном угловом градусе */
#define  GR         0.017453292519943296//550
/* (PI/180.0/60.0) Радиан в одной угловой минуте */
#define  MR         0.000290888208765721//58
/* (PI/180.0/60.0/60.0) Радиан в одной угловой секунде */
#define  SR         0.000004848136811095359//84

/* Число е */
#define  NUMBER_E          2.718281828459045//23536028747135266249

#define eps12			0.000000000001

#define eps8			0.00000001

#define	AU	149597870.691e0

#define	e22  0.006694479245829

#define	e2  0.006693421623
#define	e2_KP  0.006693421623

#define	Rp  6356.751

#define	Re  6378.245
#define	a_KP  6378.245

#define	sd  86400

#define	TB  4

#define	RL  1738.4

#define	VSVET  299792.458

#define Tcc  86400

#define	VEK  36525.0

#define	RS  4.848136811095e-6

#define	Cv 299792.458

#define DSH   0.25

#define	Da_KP  150

#endif
